{
  "common": {
    "loading": "Chargement...",
    "error": "Erreur",
    "header": {
      "scale": "Gamme",
      "note": "Note",
      "about": "À propos",
      "home": "Accueil",
      "crossInstruments": "Instruments",
      "intervals": "Intervalles"
    }
  },
  "languageSelector": {
    "label": "Langue:"
  },
  "notationSelector": {
    "label": "Notation:",
    "romance": "latine",
    "german": "allemande",
    "english": "anglaise"
  },
  "landing": {
    "title": "Transposition",
    "welcome": "Bienvenue sur ClaveShift.com!",
    "description": "ClaveShift.com, anciennement MusicTranspositor.com est un outil en ligne de transposition musicale qui vous permet de transposer facilement une note d'une tonalité à une autre.",
    "aboutLink": "Pour plus d'informations sur la transposition musicale, veuillez visiter la page <0>À propos</0>.",
    "quickStart": "Prise en main rapide :",
    "instrumentFrom": "Vous jouez d'un instrument en",
    "instrumentTo": "et souhaitez connaître les gammes correspondantes pour un instrument en",
    "commonKeys": "Voici quelques tonalités courantes:"
  },
  "about": {
    "title": "À propos",
    "mainHeading": "À propos de la transposition musicale",
    "description1": "La transposition musicale est le processus de déplacement d'une collection de notes (une mélodie, une harmonie ou une gamme) vers le haut ou vers le bas par un intervalle constant. Cela signifie que chaque note de la pièce est élevée ou abaissée de la même distance, ce qui donne une nouvelle tonalité. La transposition est couramment utilisée en musique pour s'adapter à différentes tessitures vocales, à l'accordage des instruments ou pour rendre une pièce plus facile à lire et à jouer.",
    "description2": "Ce site web est un outil conçu pour faciliter des transpositions rapides. Il propose une interface simple pour transposer une note d'une tonalité à une autre, ainsi qu'une interface plus avancée permettant de transposer une gamme complète. Cela permet, par exemple, de jouer rapidement une pièce dans la même tonalité lorsque vous jouez avec deux instruments ayant deux tonalités différentes.",
    "nameHeading": "À propos du nom <0>ClaveShift</0> :",
    "nameIntro": "Le nom <0>ClaveShift</0> combine deux termes : <1>clave</1> et <2>shift</2>.",
    "claveMeaning": "<0>Clave</0> : En espagnol, \"clave\" signifie \"tonalité\" ou \"clé\", ce qui se rapporte directement aux tonalités musicales et à la transposition. En théorie musicale, changer de tonalité est un concept clé, et \"Clave\" reflète l'objectif de cet outil axé sur les changements de tonalité.",
    "shiftMeaning": "<0>Shift</0> : \"Shift\" (changement, décalage) exprime l'action de passer d'une tonalité à une autre, ce que cet outil fait précisément : il permet de déplacer des notes et des gammes entre tonalités pour faciliter la transposition pour les musiciens.",
    "instrumentListTitle": "Voici une liste non exhaustive d'instruments triés par leur tonalité possible:"
  },
  "stepper": {
    "step1Title": "Quel instrument jouez-vous ?",
    "step2Title": "Que jouez-vous ?",
    "step3Title": "Transposer pour quel instrument ?",
    "edit": "Modifier",
    "continue": "Continuer",
    "custom": "Personnalisé",
    "transposeBy": "Transposer par :",
    "byKey": "Tonalité",
    "byInterval": "Intervalle",
    "intervalStepTitle": "Transposer de quel intervalle ?",
    "circleOfFifthsTitle": "Cycle des quintes",
    "circleOfFifthsDescription": "Le cycle des quintes dispose les 12 tonalités musicales de sorte que chaque paire adjacente est séparée par une quinte juste (7 demi-tons). Le mouvement dans le sens horaire ajoute des dièses ; dans le sens anti-horaire, des bémols. Les tonalités adjacentes partagent toutes leurs notes sauf une, ce qui les rend étroitement liées harmoniquement.",
    "circleOfFifthsExplanation": "L’aiguille bleue pointe vers la tonalité d’origine et l’aiguille rouge vers la tonalité cible. Un petit angle signifie que les tonalités sont harmoniquement proches et partagent la plupart de leurs notes — la transposition impliquera peu de changements. Un grand angle (jusqu’à 180°, le triton) indique des tonalités plus éloignées, nécessitant davantage d’altérations. Cette proximité harmonique ne correspond pas à la proximité chromatique : des tonalités séparées d’un demi-ton (une seconde mineure) se trouvent presque à l’opposé sur le cycle, tandis que des tonalités séparées d’une quinte sont voisines. La couronne extérieure montre les armures, la couronne intérieure les noms des gammes dans le mode sélectionné. Utilisez le bouton sous le cycle pour changer de mode.",
    "noteSelectDescription": "Choisissez la note que vous souhaitez transposer. Utilisez le sélecteur ci-dessus pour choisir entre transposer entre tonalités d'instruments ou par un intervalle musical.",
    "scaleSelectDescription": "Choisissez la note fondamentale et le mode de la gamme. Les modes comme Majeur et Mineur définissent le schéma de tons et demi-tons qui donne à la gamme son caractère.",
    "originInstrumentDescription": "Les instruments transpositeurs produisent une hauteur différente de celle écrite — par exemple, une clarinette en Si♭ produit un Si♭ lorsque le musicien lit un Do. Sélectionnez l'instrument ou la tonalité pour laquelle votre musique est écrite.",
    "targetInstrumentDescription": "Sélectionnez l'instrument ou la tonalité cible. L'outil calculera les notes écrites correctes pour que les deux instruments produisent les mêmes hauteurs.",
    "intervalSelectDescription": "Un intervalle mesure la distance entre deux notes en demi-tons. Choisissez la direction et la taille de l'intervalle de transposition.",
    "originalStaffLabel": "Original",
    "transposedStaffLabel": "Transposé",
    "originalInstrumentStaffLabel": "{{instrument}} (original)",
    "transposedInstrumentStaffLabel": "{{instrument}} (transposé)"
  },
  "transposition": {
    "common": {
      "originKey": "Tonalité d'origine",
      "targetKey": "Tonalité cible",
      "note": "Note",
      "scale": "Gamme",
      "up": "vers le haut",
      "down": "vers le bas",
      "staffLabel": "Instrument en <0>{{key}}</0>:",
      "instrumentPlaceholder": "Sélectionner ou rechercher un instrument"
    },
    "scaleIntervals": {
      "toolDescription": "Transposez une gamme complète, dans n'importe quel mode, d'une tonalité d'un instrument à une autre:",
      "intervalLabel": "Direction et intervalle:",
      "originScaleDefinition": "La gamme de <0>{{scale}}</0> se compose des notes suivantes :",
      "noKeyChangeNeeded": " Aucun changement de tonalité n'est nécessaire car l'intervalle de demi-tons est de 0.",
      "simplerEnharmonicEquivalent": "Cependant, un équivalent enharmonique potentiellement plus simple est la gamme de <0>{{enharmonicScale}}</0>, qui se compose des notes suivantes :",
      "transpositionResult": "Elle devient la gamme de <0>{{targetScale}}</0>, avec les notes suivantes : <1>{{notes}}</1>, lorsqu'elle est transposée {{direction}} d'une {{interval}}."
    },
    "crossInstruments": {
      "toolDescription": "Transposez une gamme complète dans n'importe quel mode d'une tonalité d'instrument à une autre :",
      "sameKeyMessage": "La gamme de <0>{{scale}} {{mode}}</0>, pour un instrument en <1>{{originKey}}</1>, se compose des notes suivantes : <2>{{notes}}</2>. Aucune transposition n'est nécessaire car les tonalités d'origine et cible sont identiques.",
      "transpositionMessage": "La gamme de <0>{{scale}} {{mode}}</0>, pour un instrument en <1>{{originKey}}</1>, se compose des notes suivantes : <2>{{notes}}</2>. Elle devient la gamme de <3>{{targetScale}} {{mode}}</3>, avec les notes suivantes : <4>{{transposedNotes}}</4> lorsqu'elle est transposée pour un instrument en <5>{{targetKey}}</5>."
    },
    "simpleTransposition": {
      "toolDescription": "Transposez une note unique d'une tonalité d'instrument à une autre :",
      "sameKeyMessage": "La note <0>{{note}}</0> pour un instrument en <1>{{originKey}}</1> se joue comme <2>{{note}}</2>. Aucune transposition n'est nécessaire car les tonalités d'origine et cible sont identiques.",
      "transpositionMessage": "La note <0>{{note}}</0> pour un instrument en <1>{{originKey}}</1> doit être jouée comme <2>{{transposedNote}}</2> pour un instrument en <3>{{targetKey}}</3>."
    },
    "noteIntervals": {
      "noChangeNeeded": "La note <0>{{note}}</0> n'a pas besoin de transposition car l'intervalle de demi-tons est de 0.",
      "transpositionResult": "La note <0>{{note}}</0> devient <1>{{transposedNote}}</1> lorsqu'elle est transposée {{direction}} d'une {{interval}}."
    }
  },
  "inlineBar": {
    "note": "Note",
    "scale": "Gamme",
    "mode": "Mode",
    "up": "Haut",
    "down": "Bas"
  }
}

