{
  "common": {
    "loading": "Laden...",
    "error": "Fehler",
    "header": {
      "scale": "Tonleiter",
      "note": "Ton",
      "about": "Info",
      "home": "Start",
      "crossInstruments": "Instrumente",
      "intervals": "Intervalle"
    }
  },
  "languageSelector": {
    "label": "Sprache:"
  },
  "notationSelector": {
    "label": "Notation:",
    "romance": "lateinische",
    "german": "deutsche",
    "english": "englische"
  },
  "landing": {
    "title": "Transposition",
    "welcome": "Willkommen bei ClaveShift.com!",
    "description": "ClaveShift.com, früher MusicTranspositor.com, ist ein Online-Transpositionswerkzeug, mit dem Sie einfach eine Note von einer Tonart in eine andere transponieren können.",
    "aboutLink": "Für detailliertere Informationen zur Musiktransposition besuchen Sie bitte die <0>Über-Seite</0>.",
    "quickStart": "Schnellstart:",
    "instrumentFrom": "Sie spielen ein Instrument in",
    "instrumentTo": "und möchten die entsprechenden Tonarten für ein Instrument in",
    "commonKeys": "Hier sind einige gängige Tonarten:"
  },
  "about": {
    "title": "Info",
    "mainHeading": "Über die Musikalische Transposition",
    "description1": "Die musikalische Transposition ist der Prozess, eine Sammlung von Noten (wie eine Melodie, Harmonie oder Tonleiter) um einen konstanten Intervall nach oben oder unten zu verschieben. Dies bedeutet, dass jede Note im Musikstück proportional um die gleiche Tonhöhe verändert wird, was zu einer neuen Tonart führt. Transposition wird häufig verwendet, um unterschiedliche Stimmumfänge, die Stimmung von Instrumenten oder ein Stück leichter lesbar und spielbar zu machen.",
    "description2": "Diese Website ist ein Werkzeug, um schnelle Transpositionen zu ermöglichen. Es bietet eine einfache Oberfläche zum Transponieren einer einzelnen Note von einer Tonart in eine andere sowie eine erweiterte Oberfläche zum Transponieren einer gesamten Tonleiter von einer Tonart in eine andere. Dies ermöglicht es, beispielsweise ein Stück schnell in der gleichen Tonart zu spielen, wenn man mit zwei verschiedenen Instrumenten spielt, die unterschiedliche Stimmungen haben.",
    "nameHeading": "Über den Namen <0>ClaveShift</0>:",
    "nameIntro": "Der Name <0>ClaveShift</0> kombiniert zwei Begriffe: <1>clave</1> und <2>shift</2>.",
    "claveMeaning": "<0>Clave</0>: Im Spanischen bedeutet \"clave\" \"Tonart\" oder \"Schlüssel\", was direkt mit musikalischen Tonarten und Transpositionen zusammenhängt. In der Musiktheorie ist das Wechseln der Tonart ein grundlegendes Konzept, und \"Clave\" spiegelt den Fokus dieses Tools auf Tonartwechsel wider.",
    "shiftMeaning": "<0>Shift</0>: \"Shift\" (Wechsel, Verschiebung) beschreibt die Aktion, eine Note oder eine Tonleiter von einer Tonart in eine andere zu verschieben, was genau das ist, was dieses Tool tut – es verschiebt Noten und Tonleitern zwischen Tonarten, um Musikern die Transposition zu erleichtern.",
    "instrumentListTitle": "Hier ist eine nicht exhaustive Liste von Instrumenten, sortiert nach ihren möglichen Tonarten:"
  },
  "stepper": {
    "step1Title": "Welches Instrument spielen Sie?",
    "step2Title": "Was spielen Sie?",
    "step3Title": "Für welches Instrument transponieren?",
    "edit": "Bearbeiten",
    "continue": "Weiter",
    "custom": "Benutzerdefiniert",
    "transposeBy": "Transponieren nach:",
    "byKey": "Tonart",
    "byInterval": "Intervall",
    "intervalStepTitle": "Um welches Intervall transponieren?",
    "circleOfFifthsTitle": "Quintenzirkel",
    "circleOfFifthsDescription": "Der Quintenzirkel ordnet alle 12 musikalischen Tonarten so an, dass jedes benachbarte Paar durch eine reine Quinte (7 Halbtöne) getrennt ist. Bewegung im Uhrzeigersinn fügt Kreuze hinzu, gegen den Uhrzeigersinn Bs. Benachbarte Tonarten teilen alle Töne bis auf einen, was sie harmonisch eng verwandt macht.",
    "circleOfFifthsExplanation": "Der blaue Zeiger zeigt auf die Ursprungstonart und der rote Zeiger auf die Zieltonart. Ein kleiner Winkel bedeutet, dass die Tonarten harmonisch eng verwandt sind und die meisten Töne teilen — die Transposition erfordert nur minimale Änderungen. Ein großer Winkel (bis zu 180°, der Tritonus) deutet auf entferntere Tonarten hin, die mehr Versetzungszeichen erfordern. Diese harmonische Nähe entspricht nicht der chromatischen Nähe: Tonarten, die einen Halbton auseinander liegen (eine kleine Sekunde), befinden sich fast gegenüber auf dem Zirkel, während Tonarten im Abstand einer Quinte Nachbarn sind. Der äußere Ring zeigt die Tonartvorzeichnungen, der innere Ring die Skalennamen im gewählten Modus. Verwenden Sie den Button unter dem Zirkel, um den Modus zu wechseln.",
    "noteSelectDescription": "Wählen Sie die Note, die Sie transponieren möchten. Verwenden Sie den Umschalter oben, um zwischen Transposition zwischen Instrumententonarten oder nach einem musikalischen Intervall zu wählen.",
    "scaleSelectDescription": "Wählen Sie den Grundton und den Modus der Tonleiter. Modi wie Dur und Moll definieren das Muster aus Ganz- und Halbtonschritten, das der Tonleiter ihren Charakter verleiht.",
    "originInstrumentDescription": "Transponierende Instrumente klingen anders als notiert — zum Beispiel klingt eine B♭-Klarinette als B♭, wenn der Spieler ein C liest. Wählen Sie das Instrument oder die Tonart, für die Ihre Musik geschrieben ist.",
    "targetInstrumentDescription": "Wählen Sie das Zielinstrument oder die Zieltonart. Das Tool berechnet die korrekten geschriebenen Noten, damit beide Instrumente die gleichen klingenden Tonhöhen erzeugen.",
    "intervalSelectDescription": "Ein Intervall misst den Abstand zwischen zwei Tönen in Halbtönen. Wählen Sie die Richtung und die Größe des Transpositionsintervalls.",
    "originalStaffLabel": "Original",
    "transposedStaffLabel": "Transponiert",
    "originalInstrumentStaffLabel": "{{instrument}} (Original)",
    "transposedInstrumentStaffLabel": "{{instrument}} (transponiert)"
  },
  "transposition": {
    "common": {
      "originKey": "Ursprungstonalität",
      "targetKey": "Zieltonalität",
      "note": "Note",
      "scale": "Tonleiter",
      "up": "nach oben",
      "down": "nach unten",
      "staffLabel": "Instrument in <0>{{key}}</0>:",
      "instrumentPlaceholder": "Instrument auswählen oder suchen"
    },
    "scaleIntervals": {
      "toolDescription": "Transponiere eine vollständige Tonleiter in einem beliebigen Modus von der Tonart eines Instruments auf eine andere:",
      "intervalLabel": "Richtung und Intervall:",
      "originScaleDefinition": "Die Tonleiter von <0>{{scale}}</0> besteht aus den folgenden Noten:",
      "noKeyChangeNeeded": " Es ist keine Tonartänderung erforderlich, da das Intervall in Halbtönen 0 beträgt.",
      "simplerEnharmonicEquivalent": "Ein potenziell einfacheres enharmonisches Äquivalent ist jedoch die Tonleiter von <0>{{enharmonicScale}}</0>, die aus den folgenden Noten besteht:",
      "transpositionResult": "Dies wird zur Tonleiter von <0>{{targetScale}}</0>, mit den folgenden Noten: <1>{{notes}}</1>, wenn es {{direction}} {{interval}} transponiert wird."
    },
    "crossInstruments": {
      "toolDescription": "Transponiere eine vollständige Tonleiter in einem beliebigen Modus von der Tonart eines Instruments auf eine andere:",
      "sameKeyMessage": "Die Tonleiter von <0>{{scale}} {{mode}}</0>, für ein Instrument in <1>{{originKey}}</1>, besteht aus den folgenden Noten: <2>{{notes}}</2>. Es ist keine Transposition erforderlich, da die Ursprungs- und Zieltonalität identisch sind.",
      "transpositionMessage": "Die Tonleiter von <0>{{scale}} {{mode}}</0>, für ein Instrument in <1>{{originKey}}</1>, besteht aus den folgenden Noten: <2>{{notes}}</2>. Dies wird zur Tonleiter von <3>{{targetScale}} {{mode}}</3>, mit den folgenden Noten: <4>{{transposedNotes}}</4>, wenn es für ein Instrument in <5>{{targetKey}}</5> transponiert wird."
    },
    "simpleTransposition": {
      "toolDescription": "Transponiere einen einzelnen Ton von der Tonart eines Instruments auf eine andere:",
      "sameKeyMessage": "Der Ton <0>{{note}}</0> für ein Instrument in <1>{{originKey}}</1> wird als <2>{{note}}</2> gespielt. Es ist keine Transposition erforderlich, da die Ursprungs- und Zieltonalität identisch sind.",
      "transpositionMessage": "Der Ton <0>{{note}}</0> für ein Instrument in <1>{{originKey}}</1> soll als <2>{{transposedNote}}</2> für ein Instrument in <3>{{targetKey}}</3> gespielt werden."
    },
    "noteIntervals": {
      "noChangeNeeded": "Der Ton <0>{{note}}</0> benötigt keine Transposition, da das Intervall in Halbtönen 0 beträgt.",
      "transpositionResult": "Der Ton <0>{{note}}</0> wird zu <1>{{transposedNote}}</1>, wenn er {{direction}} um {{interval}} transponiert wird."
    }
  },
  "inlineBar": {
    "note": "Ton",
    "scale": "Tonleiter",
    "mode": "Modus",
    "up": "Aufwärts",
    "down": "Abwärts"
  }
}